<h2>Soal 1: Pivoting and Melting</h2>

Jelaskan itu pivoting dan melting data

jawaban:
pivot adalah suatu pengubahan bentuk data dengan memutar datayg terletak di column menjadi baris
melting adalah pengubahan suatu data dengan memutar dari tadinya berada di posisi row menjadi posisi column

<h2>Soal 2: Data structure Comprehension</h2>

Data yang rapi adalah:
1. Setiap row menunjukan suatu unit observasi
2. Setiap column merupakan suatu unit variable

Bagaimana pun, dalam menentukan unit observasi itu tergantung dari kasus yang di hadapi. sebagai seorang data scientist pasti akan menemukan berbagai bentuk struktur data. adalah sangat penting bagi seorang data scientist untuk dapat memahami dan menjelaskan setiap struktur data. Kemampuan memahami hubungan antara index baris, column dan isi data adalah kunci untuk memahami informasi apa yang data sedang beritahukan kepada kita.

Di bawah ini terdapat 2 data yang berisi sama, tetapi memiliki struktur yang berbeda. Jelaskan perbedaan dari 2 struktur data tersebut

![alt text](https://drive.google.com/uc?id=1h13CDPzIjc-2XyRcyu-p1fet0Ep1gdMA)

![alt text](https://drive.google.com/uc?id=12ji98ell5tNcCxeBzl4v8qqBtFMgDSr0)

tabel yang atas lebih bagus untuk membandingkan karena menggunakan bentuk pivot sedangkan yang bawah berbentuk melting yang baik dipergunakan untuk list laporan satuan data

<h2>Soal 3: Reshaping Data 1</h2>

In [35]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}
df = pd.DataFrame(data)
df

   Mata Pelajaran  Rata2 Nilai Ujian  Rata2 Waktu Belajar (menit) Tipe Ujian
0          Fisika                 75                          257       UTS1
1          Fisika                 73                          713       UAS1
2          Fisika                 58                          531       UTS2
3          Fisika                 92                          327       UAS2
4      Matematika                 76                          518       UTS1
5      Matematika                 86                          462       UAS1
6      Matematika                 82                          312       UTS2
7      Matematika                 77                          648       UAS2
8      Statistika                 55                          435       UTS1
9      Statistika                 70                          489       UAS1
10     Statistika                 76                          437       UTS2
11     Statistika                 57                          716       UAS2

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [36]:
# code here
pivot_result = df.pivot_table(index='Tipe Ujian',columns='Mata Pelajaran', values=['Rata2 Nilai Ujian','Rata2 Waktu Belajar (menit)'])
display(pivot_result)

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          73         86         70
UAS2                          92         77         57
UTS1                          75         76         55
UTS2                          58         82         76

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   713        462        489
UAS2                                   327        648        716
UTS1                                   257        518        435
UTS2                                   531        312        437

Expected Result:

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)

<h2>Soal 4: Reshaping Data 2</h2>

In [33]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
df.reset_index(inplace = True)
#print(df)
pd.melt(df,id_vars=['Hari'], value_vars = ['Bali','Disney','Dufan','Kebun Binatang'])

     Hari        variable  value
0   Sabtu            Bali    900
1  Minggu            Bali    803
2   Sabtu          Disney   1000
3  Minggu          Disney   1001
4   Sabtu           Dufan    501
5  Minggu           Dufan    700
6   Sabtu  Kebun Binatang    271
7  Minggu  Kebun Binatang    399

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

Expected Result:

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)

<h2>Soal 5: Pivoting and Aggregating</h2>

In [52]:
import pandas as pd

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1']*3,
    'Mata Pelajaran' :['Statistika', 'Fisika', 'Fisika', 'Statistika', 'Fisika', 'Statistika'],
    'Jumlah Peserta' : [14, 17, 12, 16, 14, 13]
}
df = pd.DataFrame(data).set_index('Tipe Ujian')
df

            Jumlah Peserta Mata Pelajaran
Tipe Ujian
UTS1                    14     Statistika
UAS1                    17         Fisika
UTS1                    12         Fisika
UAS1                    16     Statistika
UTS1                    14         Fisika
UAS1                    13     Statistika

Perhatikan bahwa data jumlah peserta ujian untuk suatu tipe ujian dan mata pelajaran tertentu ada yang duplikat, ubahlah struktur data tersebut dan lakukan aggregasi berjenis jumlah sehingga sesuai dengan hasil yang di harapkan

Expected Result:

![alt text](https://drive.google.com/uc?id=1emoz7orYR-0mCHffvAgM8j-V1P6yVHf0)

In [57]:
#Code here
import pandas as pd
df.reset_index()
df.pivot_table(index='Tipe Ujian',columns='Mata Pelajaran', values=['Jumlah Peserta'], aggfunc='sum')

               Jumlah Peserta
Mata Pelajaran         Fisika Statistika
Tipe Ujian
UAS1                       17         29
UTS1                       26         14